backend/controllers/AdminController.php

SELECT * FROM `my_company` WHERE `company_id`='9'
---
    public function actionSave(){
        $model = new CompanyForm();
        if($model->load(\Yii::$app->request->post())){
            $data = \Yii::$app->request->post();
            $params = $data['CompanyForm'];

            //更新或者添加
            if(!empty($params['company_id'])){
                $model = Company::findOne($params['company_id']);