backend/controllers/ChannelOverseasController.php

SELECT * FROM `my_country` WHERE `country_id`='2'
---
    public function actionList() {
        $model = new ChannelOverseasForm();
        $fields = '*';
        $allList = $model::find()->select($fields);
        $pages = new Pagination(['totalCount' =>$allList->count(), 'pageSize' => '50']);
        $allList = $allList->offset($pages->offset)->limit($pages->limit)->asArray()->all();
        foreach($allList as $key => $list){
            //国家名称
            $country = Country::findOne($list['country_id']);