backend/controllers/LogisticsChannelController.php

    public function actionList() {
        $fields = 'lc_id,name,country_id,channel_overseas_id,channel_domestic_id,is_moyun,is_include_demestic,is_idcard,is_tariff,code';
        $model = new LogisticsChannel();
        $allList = $model::find()->select($fields);
        $pages = new Pagination(['totalCount' =>$allList->count(), 'pageSize' => '50']);
        $allList = $allList->offset($pages->offset)->limit($pages->limit)->asArray()->all();

        //数据重组
        foreach($allList as $key => $list){
            //国家名称
            $country = Country::findOne($list['country_id']);
            $allList[$key]['country'] = $country['name'];

            //海外渠道
            $overSea = ChannelOverseas::findOne($list['channel_overseas_id']);
---
SELECT * FROM `my_country` WHERE `country_id`='1'
SELECT * FROM `my_channel_overseas` WHERE `co_id`='27'