<?php
/**
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2016/11/24
 * Time: 17:10
 */

namespace api\controllers;
use Yii;
use yii\web\Controller;
use yii\helpers\Json;


class GetLogisticsInfoController extends Controller
{
    private static $LOGISTICSINFOMAP = [
        '9742543008699'=>[
            'com'=>'1',
            'nu'=>'9742543008699',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543009099'=>[
            'com'=>'1',
            'nu'=>'9742543009099',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543010999'=>[
            'com'=>'1',
            'nu'=>'9742543010999',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543011299'=>[
            'com'=>'1',
            'nu'=>'9742543011299',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543012699'=>[
            'com'=>'1',
            'nu'=>'9742543012699',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543013099'=>[
            'com'=>'1',
            'nu'=>'9742543013099',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543014399'=>[
            'com'=>'1',
            'nu'=>'9742543014399',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543015799'=>[
            'com'=>'1',
            'nu'=>'9742543015799',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543016599'=>[
            'com'=>'1',
            'nu'=>'9742543016599',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9742543017499'=>[
            'com'=>'1',
            'nu'=>'9742543017499',
            'message'=>'ok',
            'status'=>1,
            'state'=>0,
            'data'=>[

            ],
        ],
        '9737847553299'=>[
            'com'=>'1',
            'nu'=>'9737847553299',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-29 4:39:00','context'=>'【厦门市】投递并签收，签收人：他人收 1'],
                ['time'=>'2016-11-29 3:37:07','context'=>'【厦门市】厦门市鹭江收投部安排投递（投递员姓名：杨青山;联系电话：）'],
                ['time'=>'2016-11-29 2:36:00','context'=>'【厦门市】已离开厦门市处理中心，发往厦门市鹭江收投部'],
                ['time'=>'2016-11-29 2:26:00','context'=>'【福州市】离开福州市 发往下一城市（经转）'],
                ['time'=>'2016-11-28 6:28:00','context'=>'【成都市】离开成都市 发往福州市'],
                ['time'=>'2016-11-25 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847554699'=>[
            'com'=>'1',
            'nu'=>'9737847554699',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-28 8:53:21','context'=>'【厦门市】投递并签收，签收人：他人收 家人'],
                ['time'=>'2016-11-28 6:09:00','context'=>'【厦门市】厦门市分公司湖滨南揽投部安排投递，预计23:59:00前投递（投递员姓名：黄厚富;联系电话：15980751986）'],
                ['time'=>'2016-11-28 5:21:00','context'=>'【厦门市】已离开厦门市处理中心，发往厦门航站'],
                ['time'=>'2016-11-28 1:50:00','context'=>'【福州市】离开福州市 发往下一城市（经转）'],
                ['time'=>'2016-11-27 6:17:00','context'=>'【福州市】到达福州市邮件处理中心处理中心（经转）'],
                ['time'=>'2016-11-26 5:57:00','context'=>'【成都市】离开成都市 发往福州市'],
                ['time'=>'2016-11-25 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847555099'=>[
            'com'=>'1',
            'nu'=>'9737847555099',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-29 4:45:05','context'=>'【佛山市】投递并签收，签收人：他人收 他人收'],
                ['time'=>'2016-11-29 2:35:00','context'=>'【佛山市】佛山市顺德区杏坛速递揽投站安排投递，预计23:59:00前投递（投递员姓名：吴锦辉;联系电话：13928246705'],
                ['time'=>'2016-11-29 3:34:53','context'=>'【佛山市】离开佛山市 发往佛山市顺德区杏坛速递揽投站'],
                ['time'=>'2016-11-29 11:02:03','context'=>'【佛山市】到达 佛山市 处理中心'],
                ['time'=>'2016-11-29 9:14:00','context'=>'【中山市】离开中山市 发往佛山市（经转）'],
                ['time'=>'2016-11-28 3:22:00','context'=>'【中山市】到达中山三角处理中心处理中心（经转）'],
                ['time'=>'2016-11-26 9:11:08','context'=>'【成都市】离开成都市 发往中山市'],
                ['time'=>'2016-11-25 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847556399'=>[
            'com'=>'1',
            'nu'=>'9737847556399',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-26 11:30:48','context'=>'【成都市】投递并签收，签收人：他人收 易邮柜'],
                ['time'=>'2016-11-26 8:21:00','context'=>'【成都市】成速汪家拐揽投站安排投递，预计13:00:00前投递（投递员姓名：王建辉;联系电话：18081966210）'],
                ['time'=>'2016-11-26 5:43:10','context'=>'【成都市】离开成都处理中心 发往成速汪家拐揽投站'],
                ['time'=>'2016-11-26 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847557799'=>[
            'com'=>'1',
            'nu'=>'9737847557799',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-29 12:28:31','context'=>'【东莞市】投递并签收，签收人：他人收 他人收鞋柜'],
                ['time'=>'2016-11-29 8:16:07','context'=>'【东莞市】东莞市邮政速递物流公司周溪揽投部安排投递，预计13:00:00前投递（投递员姓名：庾国良;联系电话：18098238618）'],
                ['time'=>'2016-11-29 6:37:00','context'=>'【中山市】离开中山市 发往下一城市（经转）'],
                ['time'=>'2016-11-28 11:34:00','context'=>'【中山市】离开中山市 发往东莞市（经转'],
                ['time'=>'2016-11-28 3:22:00','context'=>'【中山市】到达中山三角处理中心处理中心（经转）'],
                ['time'=>'2016-11-26 10:10:58','context'=>'【成都市】离开成都市 发往中山市'],
                ['time'=>'2016-11-26 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847558599'=>[
            'com'=>'1',
            'nu'=>'9737847558599',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-29 12:28:29','context'=>'【东莞市】投递并签收，签收人：他人收 他人收鞋柜'],
                ['time'=>'2016-11-29 8:17:36','context'=>'【东莞市】东莞市邮政速递物流公司周溪揽投部安排投递，预计13:00:00前投递（投递员姓名：庾国良;联系电话：18098238618）'],
                ['time'=>'2016-11-28 11:34:00','context'=>'【中山市】离开中山市 发往东莞市（经转'],
                ['time'=>'2016-11-28 3:22:00','context'=>'【中山市】到达中山三角处理中心处理中心（经转）'],
                ['time'=>'2016-11-26 10:10:38','context'=>'【成都市】离开成都市 发往中山市'],
                ['time'=>'2016-11-26 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847559499'=>[
            'com'=>'1',
            'nu'=>'9737847559499',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-30 12:46:47','context'=>'【上海市】投递并签收，签收人：他人收 家人'],
                ['time'=>'2016-11-30 8:11:52','context'=>'【上海市】五角场(本部）安排投递，预计14:30:00前投递（投递员姓名：王国军;联系电话：18301907332'],
                ['time'=>'2016-11-29 3:54:03','context'=>'【上海市】未妥投，原因：收件人不在指定地址'],
                ['time'=>'2016-11-29 2:26:20','context'=>'【上海市】五角场(本部）安排投递，预计23:59:00前投递（投递员姓名：张海平;联系电话：13818012977）'],
                ['time'=>'2016-11-29 9:52:52','context'=>'【上海市】到达 上海处理中心 处理中心'],
                ['time'=>'2016-11-29 8:36:00','context'=>'【上海市】已离开上海站火车转运站，发往上海处理中心'],
                ['time'=>'2016-11-29 5:35:00','context'=>'【上海市】到达 上海市 处理中心'],
                ['time'=>'2016-11-29 5:47:00','context'=>'【成都市】离开成都市 发往上海市'],
                ['time'=>'2016-11-26 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847560399'=>[
            'com'=>'1',
            'nu'=>'9737847560399',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-29 10:21:00','context'=>'【扬州市】投递并签收，签收人：他人收 云柜'],
                ['time'=>'2016-11-29 2:39:20','context'=>'【扬州市】高邮市龙奔邮政支局安排投递（投递员姓名：蒋红叶;联系电话：）'],
                ['time'=>'2016-11-29 11:33:00','context'=>'【扬州市】离开扬州高邮市 发往高邮市龙奔邮政支局'],
                ['time'=>'2016-11-29 6:27:00','context'=>'【扬州市】到达 扬州高邮市 处理中心'],
                ['time'=>'2016-11-29 5:09:00','context'=>'【扬州市】已离开扬州邮区中心局邮件处理中心，发往扬州高邮市'],
                ['time'=>'2016-11-28 7:28:00','context'=>'【扬州市】已离开扬州邮区中心局邮件处理中心，发往中国邮政速递物流股份有限公司扬州市分公司'],
                ['time'=>'2016-11-28 6:07:00','context'=>'【扬州市】到达 扬州邮区中心局邮件处理中心 处理中心'],
                ['time'=>'2016-11-28 3:46:00','context'=>'【南京市】离开南京市 发往扬州市（经转）'],
                ['time'=>'2016-11-28 8:25:00','context'=>'【南京市】到达南京邮区中心局邮件处理中心处理中心（经转）'],
                ['time'=>'2016-11-27 4:40:00','context'=>'【成都市】离开成都市 发往南京市'],
                ['time'=>'2016-11-26 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847561799'=>[
            'com'=>'1',
            'nu'=>'9737847561799',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-29 2:38:00','context'=>'【天津市】投递并签收，签收人：本人收'],
                ['time'=>'2016-11-29 7:24:14','context'=>'【天津市】天津市邮政投递局天泰路投递分局安排投递（投递员姓名：郑瑞;联系电话：）'],
                ['time'=>'2016-11-29 6:07:00','context'=>'【天津市】离开天津邮区中心局 发往天津市邮政投递局天泰路投递分局'],
                ['time'=>'2016-11-28 3:42:00','context'=>'【天津市】到达 天津邮区中心局 处理中心'],
                ['time'=>'2016-11-28 1:38:00','context'=>'【成都市】离开成都市 发往下一城市'],
                ['time'=>'2016-11-26 9:44:00','context'=>'【成都市】离开成都市 发往天津市'],
                ['time'=>'2016-11-25 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
        '9737847562599'=>[
            'com'=>'1',
            'nu'=>'9737847562599',
            'message'=>'ok',
            'status'=>1,
            'state'=>3,
            'data'=>[
                ['time'=>'2016-11-28 6:24:28','context'=>'【长沙市】投递并签收，签收人：他人收 速递易'],
                ['time'=>'2016-11-28 8:21:21','context'=>'【长沙市】长沙市邮政速递物流公司大托揽投部安排投递，预计13:00:00前投递（投递员姓名：曹永;联系电话：85161915）'],
                ['time'=>'2016-11-28 4:50:34','context'=>'【长沙市】已离开长沙市，发往长沙市邮政速递物流公司大托揽投部'],
                ['time'=>'2016-11-28 3:36:46','context'=>'【长沙市】到达长沙市'],
                ['time'=>'2016-11-27 8:21:00','context'=>'【长沙市】到达 长沙邮区中心局星沙处理中心 处理中心'],
                ['time'=>'2016-11-26 9:18:00','context'=>'【成都市】离开成都市 发往长沙市'],
                ['time'=>'2016-11-25 0:14:53','context'=>'【成都市】成都市邮政速递物流有限公司国际业务分公司已收件（揽投员姓名：李翰恒,联系电话:）'],
                ['time'=>'2016-11-24 15:30:11','context'=>'包裹到达国内，已转国内快递'],
                ['time'=>'2016-11-22 18:35:12','context'=>'包裹已出库，送往机场'],
                ['time'=>'2016-11-20 13:35:14','context'=>'包裹已入库'],
            ],
        ],
    ];

    public function beforeAction($action) {
        parent::beforeAction($action);
        if ($this->action->id != 'getinfo' && !defined('MY_INTERFACE')) {
            die(Json::encode(['code' => '501', 'desc' => '非法请求接口']));
        }

        return true;
    }

    public function actionGetinfo() {
        define('MY_INTERFACE', TRUE);
        $request = Yii::$app->request;
        if (!$request->isGet) {
            return Json::encode(['code' => '502', 'desc' => '请求方法错误']);
        }else{
            $request = Yii::$app->request;
            $params = $request->get();
            if(!isset($params['id'])||!isset($params['com'])||!isset($params['nu'])||!isset($params['valicode'])||!isset($params['show'])||!isset($params['muti'])||!isset($params['order'])){
                return Json::encode(['code' => '503', 'desc' => '参数不完整']);
            }
            if(!$params['nu']||!array_key_exists($params['nu'],self::$LOGISTICSINFOMAP)){
                return Json::encode(['code' => '503', 'desc' => '该快递单号不存在']);
            }else {
                $data = self::$LOGISTICSINFOMAP[$params['nu']];
                if($params['show']>1){
                    return Json::encode(['code' => '503', 'desc' => '暂只支持json和xml返回']);
                }
                if($params['order']=='asc'||$params['order']=='desc'||$params['order']=='') {
                    if ($params['order'] == 'asc') {
                       // $data['data'] = strrev($data['data']);
                        $data['data'] = array_reverse($data['data']);
                    }
                }else{
                    return Json::encode(['code' => '503', 'desc' => '排序方式不合法']);
                }
                if($params['muti']=='0'){
                    $data['data'] = [$data['data'][0]];
                }
                if($params['show']==1) {
                    return \Yii::createObject([
                        'class' => 'yii\web\Response',
                        'format' => \yii\web\Response::FORMAT_XML,
                        'formatters' => [
                            \yii\web\Response::FORMAT_XML => [
                                'class' => 'yii\web\XmlResponseFormatter',
                                'rootTag' => 'xml', //根节点
                            ],
                        ],
                        'data' => [ //要输出的数据
                            $data,
                        ],
                    ]);
                }else{
                    return Json::encode($data);
                }
            }
        }


    }
}