backend/models/Admin.php

    public static function findByUsername($username) {
        $admin = NULL;
        $username = trim($username);
        if (count(self::$admins)) {
            foreach (self::$admins as $one) {
                if ($one['username'] == $username) {
                    $admin = $one;
                    break;
                }
            }
        }
        if (!$admin) {
            $admin = static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `my_admin` WHERE (`username`='myadmin') AND (`status`=10)